import React from 'react';

import './about.css'

function About() {
    return (
        <div className="about">
            <div className="block__title">
                <h2>Обо мне</h2>
                <span/>
            </div>
            <div className="about__text">
                <p>
                    Начал карьеру в продажах, в компании Евросеть. Затем перешёл в банковскую сферу. Работал в таких банках
                    как Русский Стандарт, Альфа банк, Траст, Тинькофф. Но потом, выгорел и работа стала в тягость.
                </p>
                <p>
                    Тогда задумался, о смене профессии. И остановил выбор на интернет-маркетинге. Самостоятельно научился
                    всему что было необходимо. Проработал в интернет-маркетинге 6 лет. Занимался настройкой
                    рекламы(контекст, медийка, социалки), SEO продвижением, проектировал сайты и лэндинги. На последнем
                    месте работы руководил отделом интернет-маркетинга, в команде было 6 человек.
                </p>
                <p>
                    Но потом, вакансий на рынке стало мало, а зарплаты пошли вниз и перестали удовлетворять. Тогда я, в во
                    второй раз, решил сменить профессию. На это раз выбрал веб-разработку. Самостоятельно научился верстать
                    сайты, интегрировать их на WordPress и уже полтора года занимаюсь разработкой сайтов на WP.
                </p>
                <p>
                    Этого мне оказалось не достаточно, да и спрос на подобную работу оказался не велик. Мне захотелось
                    заниматься разработкой чего-то более сложно, более крутого. Тогда я и стал усердно изучать JavaScript и
                    библиотеку React.
                </p>
                <p>
                    Прошел 5 онлайн курсов, разработал социальную сеть, интернет магазин, ToDo лист, чат и проект по
                    сокращению ссылок на стеке MERN. Учебные проекты можно посмотреть в разделе Портфолио.
                </p>
                <p>
                    Программирование мне доставляет неописуемое удовольствие. Так что продолжаю развиваться. Хочется много
                    чего сделать, а для этого предстоит много чего изучить. И в этом-то наверное и кайф, программирование -
                    постоянное интеллектуальное развитие.
                </p>
            </div>
        </div>
    );
}

export default About;